Revit 2027 API
RebarBendData.BendRadius Property
 The radius of all fillets, except hook fillets, in the Rebar shape. The default value is 0.0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BendRadius { get; set; }
Public Property BendRadius As Double
	Get
	Set
public:
property double BendRadius {
	double get ();
	void set (double value);
}
member BendRadius : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for bendRadius is not finite
Remarks
 Inner radius, not centerline
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace